### Pandas
1. Series : 1차원 Vector + 명시적 index
2. DataFrame : 2차원 Matrix + 명시적 index

### Series

In [4]:
import numpy as np
import pandas as pd

In [5]:
L = [1,2,3,5]
pd.Series(L) # index를 명시하지 않으면 0부터 자동으로 index가 생성

0    1
1    2
2    3
3    5
dtype: int64

In [8]:
L = [1,2,3,5]
pd.Series(L, index = ['a','b','c','d']) # index를 지정하면 지저오딘 인덱스로 생성

a    1
b    2
c    3
d    5
dtype: int64

In [10]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
pd.Series(L) # 딕셔너리를 시리즈로 만들면 키가 인덱스가 됨

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
s = pd.Series(L, index = ['a', 'b','c','d','e','f','g']) # 인덱스 중심으로 만들어서 value 없어도 걍 만들어버림 ㅡ.ㅡ

In [16]:
s['c']

3.0

In [17]:
s['g'] = 100
s

a      1.0
b      2.0
c      3.0
d      4.0
e      NaN
f      NaN
g    100.0
dtype: float64

In [18]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [19]:
s.values

array([  1.,   2.,   3.,   4.,  nan,  nan, 100.])

### DataFrame

In [22]:
raw_data = {
    'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
    'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
    'age': [42,52,36,24,75],
    'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']
}
raw_data

{'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
 'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
 'age': [42, 52, 36, 24, 75],
 'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']}

In [24]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [25]:
pd.DataFrame(raw_data, columns = ['last_name', 'first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [26]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [31]:
# 컬럼 선택

In [27]:
df['first_name'] # 컬럼명 인뎅싱해서 컬럼선택

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [30]:
df[['age', 'city']]

   age           city
0   42  san francisco
1   52      baltimore
2   36          miami
3   24        douglas
4   75         boston

In [36]:
df.index = ['a', 'b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [37]:
df.loc['c']

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

In [38]:
df.loc['e']

first_name       any
last_name      cooze
age               75
city          boston
Name: e, dtype: object

In [39]:
df.iloc[2]

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

In [40]:
# # df['칼럼명'] => 해당 칼럼을 출력

# # df.loc['인덱스명'] => 해당 행을 선택
# # df.iloc[row인덱스 번호] => 해당 행 선택

# df.loc['인덱스명', '칼럼명']
# df.iloc[인덱스번호, 칼럼번호]

In [41]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [43]:
df.loc[['b', 'c']]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [44]:
df.iloc[[1,2]]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [45]:
df.loc[['b', 'c'], ['last_name', 'age']]

  last_name  age
b  jacobson   52
c       ali   36

In [46]:
df.iloc[[1,2,3], [1,2]]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [47]:
df.iloc[1:4, 1:3]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [48]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [50]:
df.loc[:,'first_name':'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [51]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [52]:
df.loc[['a', 'b'], ['last_name', 'age']]

  last_name  age
a    miller   42
b  jacobson   52

In [53]:
df.loc[['a', 'b'], ['first_name', 'age']]

  first_name  age
a      jason   42
b      molly   52

In [54]:
df.iloc[[0,1], [0,1]]

  first_name last_name
a      jason    miller
b      molly  jacobson

In [55]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [56]:
df.loc[['b','c'], ['last_name', 'age', 'city']]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [57]:
df.iloc[[1,2], [1,2,3]]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [59]:
df.iloc[[1,2], 1:3]

  last_name  age
b  jacobson   52
c       ali   36

In [60]:
df.loc[['b','c'], 'first_name':'age']

  first_name last_name  age
b      molly  jacobson   52
c       tina       ali   36

In [61]:
df.loc[:, 'first_name':'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [62]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [63]:
df['age']

a    42
b    52
c    36
d    24
e    75
Name: age, dtype: int64

In [64]:
df.age

a    42
b    52
c    36
d    24
e    75
Name: age, dtype: int64

In [65]:
df['age']>40

a     True
b     True
c    False
d    False
e     True
Name: age, dtype: bool

In [ ]:
df[df['age']>40]

In [66]:
df.loc[df['age']>40]

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
e        any     cooze   75         boston

In [67]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [70]:
# 사는 곳이 마이애미인 사람 출력
df['city'] == 'miami'

a    False
b    False
c     True
d    False
e    False
Name: city, dtype: bool

In [69]:
df.loc[df['city'] == 'miami']

  first_name last_name  age   city
c       tina       ali   36  miami

In [71]:
# ali의 나이는?

In [72]:
df.last_name=='ali'

a    False
b    False
c     True
d    False
e    False
Name: last_name, dtype: bool

In [73]:
df[df.last_name=='ali']

  first_name last_name  age   city
c       tina       ali   36  miami

In [77]:
df[df.last_name=='ali'].age

c    36
Name: age, dtype: int64

In [78]:
df.T # transpose : 행과 열의 전환

                        a          b      c        d       e
first_name          jason      molly   tina     jake     any
last_name          miller   jacobson    ali   milner   cooze
age                    42         52     36       24      75
city        san francisco  baltimore  miami  douglas  boston

In [79]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [80]:
df.columns

Index(['first_name', 'last_name', 'age', 'city'], dtype='object')

In [81]:
df.to_csv('test_df.csv')

In [82]:
pwd

'D:\\Bigdata\\numpy'

In [84]:
!dir

 D 드라이브의 볼륨: 새 볼륨
 볼륨 일련 번호: 8A45-2B88

 D:\Bigdata\numpy 디렉터리

2020-10-20  오후 03:25    <DIR>          .
2020-10-20  오후 03:25    <DIR>          ..
2020-10-20  오후 12:37    <DIR>          .ipynb_checkpoints
2020-10-19  오후 06:52            27,989 20201019_01_Numpy.ipynb
2020-10-20  오후 12:25            19,794 20201020_01_Numpy_2.ipynb
2020-10-20  오후 03:24            64,790 20201020_02_pandas_1.ipynb
2020-10-20  오후 03:25               166 test_df.csv
2020-10-20  오후 12:14            11,802 Untitled.ipynb
               5개 파일             124,541 바이트
               3개 디렉터리  743,907,028,992 바이트 남음

In [86]:
df.head()

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [87]:
df.head(3)

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami

In [88]:
df.tail(2)

  first_name last_name  age     city
d       jake    milner   24  douglas
e        any     cooze   75   boston

In [89]:
del df['age']

In [90]:
df

  first_name last_name           city
a      jason    miller  san francisco
b      molly  jacobson      baltimore
c       tina       ali          miami
d       jake    milner        douglas
e        any     cooze         boston

In [92]:
df.drop('a')

  first_name last_name       city
b      molly  jacobson  baltimore
c       tina       ali      miami
d       jake    milner    douglas
e        any     cooze     boston

In [93]:
df.drop('city', axis=1) # 삭제 영역에서는 axis 방향이 바뀜

  first_name last_name
a      jason    miller
b      molly  jacobson
c       tina       ali
d       jake    milner
e        any     cooze

In [94]:
del df

In [95]:
df

NameError: name 'df' is not defined

In [97]:
df = pd.read_csv('test_df.csv')
df

  Unnamed: 0 first_name last_name  age           city
0          a      jason    miller   42  san francisco
1          b      molly  jacobson   52      baltimore
2          c       tina       ali   36          miami
3          d       jake    milner   24        douglas
4          e        any     cooze   75         boston

In [148]:
df = pd.read_csv('test_df.csv', index_col=0)
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [98]:
# apply

In [99]:
# age 칼럼의 값을 한국나이로 전환 => +1

In [104]:
kor_age = []
for a in df.age:
    kor_age.append(a+1)
kor_age

[44, 54, 38, 26, 77]

In [103]:
df

  Unnamed: 0 first_name last_name  age           city
0          a      jason    miller   43  san francisco
1          b      molly  jacobson   53      baltimore
2          c       tina       ali   37          miami
3          d       jake    milner   25        douglas
4          e        any     cooze   76         boston

In [105]:
def kor_age(a):
    return a+1

In [106]:
df['age'].apply(kor_age)

0    44
1    54
2    38
3    26
4    77
Name: age, dtype: int64

In [107]:
df['age'].apply(lambda x: x+1)

0    44
1    54
2    38
3    26
4    77
Name: age, dtype: int64

In [109]:
df['job'] = ['teacher', 'driver', 'doctor', 'cook', 'engineer']

In [110]:
df

  Unnamed: 0 first_name last_name  age           city       job
0          a      jason    miller   43  san francisco   teacher
1          b      molly  jacobson   53      baltimore    driver
2          c       tina       ali   37          miami    doctor
3          d       jake    milner   25        douglas      cook
4          e        any     cooze   76         boston  engineer

In [100]:
df['age']+1

0    43
1    53
2    37
3    25
4    76
Name: age, dtype: int64

In [102]:
df['age'] = df['age']+1

In [111]:
df['age'] = df['age'].apply(lambda x: x+1) # 위에거랑 이거랑 결과가 같음

In [114]:
wages = pd.read_csv('./wages.csv')
wages

              earn  height     sex   race  ed  age
0     79571.299011   73.89    male  white  16   49
1     96396.988643   66.23  female  white  16   62
2     48710.666947   63.77  female  white  16   33
3     80478.096153   63.22  female  other  16   95
4     82089.345498   63.08  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363   71.68    male  white  12   33
1375  24853.519514   61.31  female  white  18   86
1376  13710.671312   63.64  female  white  12   37
1377  95426.014410   71.65    male  white  12   54
1378   9575.461857   68.22    male  white  12   31

[1379 rows x 6 columns]

In [115]:
wages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1379 entries, 0 to 1378
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   earn    1379 non-null   float64
 1   height  1379 non-null   float64
 2   sex     1379 non-null   object
 3   race    1379 non-null   object
 4   ed      1379 non-null   int64
 5   age     1379 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 64.8+ KB

In [116]:
wages.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [119]:
wages['height'] = wages['height'].apply(lambda x: int(x)) # 키값 정수화

In [120]:
wages

              earn  height     sex   race  ed  age
0     79571.299011      73    male  white  16   49
1     96396.988643      66  female  white  16   62
2     48710.666947      63  female  white  16   33
3     80478.096153      63  female  other  16   95
4     82089.345498      63  female  white  17   43
...            ...     ...     ...    ...  ..  ...
1374  30173.380363      71    male  white  12   33
1375  24853.519514      61  female  white  18   86
1376  13710.671312      63  female  white  12   37
1377  95426.014410      71    male  white  12   54
1378   9575.461857      68    male  white  12   31

[1379 rows x 6 columns]

### Groupby
1. 동일 종류의 데이터끼리 묶어서 처리
2. df['칼럼'].['칼럼']. 연산함수

In [122]:
wages.groupby('sex')['earn'].mean()

# groupby 이중구조
# 1. data grouping => wages.groupby('sex')
# 2. group별 값을 계산 => ['earn'].mean()

sex
female    24245.647877
male      45993.126922
Name: earn, dtype: float64

In [123]:
#인종별 평균 교육연수(ed)

In [124]:
wages.groupby('race')['ed'].mean()

race
black       13.039683
hispanic    12.987013
other       13.965517
white       13.398431
Name: ed, dtype: float64

In [126]:
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Giant', 'Kings', \
                'Kings', 'Riders', 'Royals','Royals', 'Riders'],
       'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
       'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
       'Points':[876,788,863,673,741,812,756,788,694,721,804,923]}
data

{'Team': ['Riders',
  'Riders',
  'Devils',
  'Devils',
  'Kings',
  'Giant',
  'Kings',
  'Kings',
  'Riders',
  'Royals',
  'Royals',
  'Riders'],
 'Rank': [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
 'Year': [2014,
  2015,
  2014,
  2015,
  2014,
  2015,
  2016,
  2017,
  2016,
  2014,
  2015,
  2017],
 'Points': [876, 788, 863, 673, 741, 812, 756, 788, 694, 721, 804, 923]}

In [128]:
df = pd.DataFrame(data)
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     788
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [129]:
# 팀별 역대득점 총합

In [133]:
df.groupby('Team')['Points'].sum()

Team
Devils    1536
Giant      812
Kings     2285
Riders    3281
Royals    1525
Name: Points, dtype: int64

In [134]:
# 팀별 최고 순위

In [135]:
df.groupby('Team')['Rank'].min()

Team
Devils    2
Giant     4
Kings     1
Riders    1
Royals    1
Name: Rank, dtype: int64

In [136]:
# 연도별 최고 득점

In [137]:
df.groupby('Year')['Points'].max()

Year
2014    876
2015    812
2016    756
2017    923
Name: Points, dtype: int64

##### grouped 객체

In [138]:
grouped = df.groupby('Team')

In [139]:
grouped.get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788

In [140]:
grouped.get_group('Royals')

      Team  Rank  Year  Points
9   Royals     4  2014     721
10  Royals     1  2015     804

In [141]:
grouped.min()

        Rank  Year  Points
Team
Devils     2  2014     673
Giant      4  2015     812
Kings      1  2014     741
Riders     1  2014     694
Royals     1  2014     721

In [142]:
grouped.mean()

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Giant   4.000000  2015.000000  812.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  820.250000
Royals  2.500000  2014.500000  762.500000

In [143]:
grouped['Points'].mean()

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    820.250000
Royals    762.500000
Name: Points, dtype: float64

In [146]:
grouped[['Rank','Points']].agg([np.sum, np.mean, np.std])

       Rank                     Points
        sum      mean       std    sum        mean         std
Team
Devils    5  2.500000  0.707107   1536  768.000000  134.350288
Giant     4  4.000000       NaN    812  812.000000         NaN
Kings     5  1.666667  1.154701   2285  761.666667   24.006943
Riders    7  1.750000  0.500000   3281  820.250000  101.068871
Royals    5  2.500000  2.121320   1525  762.500000   58.689863

In [147]:
# df.groupby('Team')['Points'].mean() 요거랑 아래거랑 같은거
grouped = df.groupby('Team')
grouped['Points'].agg(np.mean)

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    820.250000
Royals    762.500000
Name: Points, dtype: float64

In [2]:
# pandas groupby ~ 'phonedata.csv'

In [4]:
import pandas as pd
import numpy as np

In [10]:
phone = pd.read_csv('phone_data.csv')
phone.head(3)

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile

In [11]:
phone.describe()

            index      duration
count  830.000000    830.000000
mean   414.500000    117.804036
std    239.744656    444.129560
min      0.000000      1.000000
25%    207.250000      1.000000
50%    414.500000     24.500000
75%    621.750000     55.000000
max    829.000000  10528.000000

In [12]:
phone.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         830 non-null    int64
 1   date          830 non-null    object
 2   duration      830 non-null    float64
 3   item          830 non-null    object
 4   month         830 non-null    object
 5   network       830 non-null    object
 6   network_type  830 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 45.5+ KB

In [13]:
# 월별 사용시간의 합계..

In [15]:
phone.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [ ]:
# 시간대별 평균 사용시간..

In [38]:
phone['date'][0].split()[1][:2]

'06'

In [30]:
def mon_scrap(x):
    return x.split()[1][:2]

In [31]:
mon_scrap(phone['date'][0])

'06'

In [33]:
phone.date.apply(mon_scrap)

0      06
1      06
2      14
3      14
4      17
       ..
825    00
826    00
827    06
828    00
829    00
Name: date, Length: 830, dtype: object

In [34]:
phone['time'] = phone.date.apply(mon_scrap)
phone.head()

   index            date  duration  item    month   network network_type time
0      0  15/10/14 06:58    34.429  data  2014-11      data         data   06
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile   06
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile   14
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile   14
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile   17

In [40]:
h_duration  = phone.groupby('time')['duration'].mean()
h_duration

time
00     23.600000
01      1.285714
02     56.600000
06     34.287086
07      3.285714
08    109.555556
09     95.947368
10     75.459459
11    102.953488
12    262.224490
13    151.480769
14     96.071429
15    224.513514
16    221.177778
17    135.350877
18    159.737705
19    196.042553
20    161.147059
21     52.800000
22      2.444444
23     54.947368
Name: duration, dtype: float64

In [42]:
h_duration.sort_values(ascending=False)

time
12    262.224490
15    224.513514
16    221.177778
19    196.042553
20    161.147059
18    159.737705
13    151.480769
17    135.350877
08    109.555556
11    102.953488
14     96.071429
09     95.947368
10     75.459459
02     56.600000
23     54.947368
21     52.800000
06     34.287086
00     23.600000
07      3.285714
22      2.444444
01      1.285714
Name: duration, dtype: float64

In [ ]:
### 'item'별 평균사용시간..?

In [45]:
phone.groupby('item')['duration'].mean()

item
call    237.940722
data     34.429000
sms       1.000000
Name: duration, dtype: float64

In [46]:
## 'item'별 사용횟수..?

In [47]:
phone.groupby('item')['date'].count()

item
call    388
data    150
sms     292
Name: date, dtype: int64

In [48]:
# 'call' 의 월별 평균사용시간?

In [49]:
phone.head()

   index            date  duration  item    month   network network_type time
0      0  15/10/14 06:58    34.429  data  2014-11      data         data   06
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile   06
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile   14
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile   14
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile   17

In [60]:
call_phone = phone.loc[phone['item'] == 'call']

In [61]:
call_phone.groupby('month')['duration'].mean()

month
2014-11    238.757009
2014-12    171.658228
2015-01    193.977273
2015-02    215.164179
2015-03    462.276596
Name: duration, dtype: float64

In [ ]:
# 'item'별, 'month'별 이용횟수를 출력..

In [66]:
multi_phone = phone.groupby(['item','month'])['date'].count()   # multi_index : 상위레벨, 하위레벨

In [67]:
# multi_index => level를 낮출 수 있음 => unstack() => 하위 인덱스가 column => table

multi_phone.unstack()

month  2014-11  2014-12  2015-01  2015-02  2015-03
item
call       107       79       88       67       47
data        29       30       31       31       29
sms         94       48       86       39       25

In [68]:
# groupby 객체화해서 사용..

In [69]:
grouped = phone.groupby('month')

In [71]:
grouped.get_group('2015-02')

,index,date,duration,item,month,network,network_type,time
577,577,13/01/15 06:58,34.429,data,2015-02,data,data,06
586,586,14/01/15 06:58,34.429,data,2015-02,data,data,06
594,594,15/01/15 06:58,34.429,data,2015-02,data,data,06
595,595,15/01/15 10:36,28.000,call,2015-02,Three,mobile,10
596,596,15/01/15 12:23,1.000,sms,2015-02,special,special,12
...,...,...,...,...,...,...,...,...
724,724,10/02/15 00:24,1.000,sms,2015-02,Vodafone,mobile,00
725,725,10/02/15 06:58,34.429,data,2015-02,data,data,06
726,726,10/02/15 21:40,1.000,sms,2015-02,Vodafone,mobile,21
727,727,11/02/15 06:58,34.429,data,2015-02,data,data,06
728,728,12/02/15 06:58,34.429,data,2015-02,data,data,06

In [72]:
grouped.agg(sum)

          index   duration
month
2014-11   26337  26639.441
2014-12   48362  14641.870
2015-01  100259  18223.299
2015-02   90398  15522.299
2015-03   78679  22750.441

In [73]:
grouped.agg({'duration': sum})

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [81]:
grouped.agg({'duration':sum, 'network_type': 'count', 'date': 'first'})

          duration  network_type            date
month
2014-11  26639.441           230  15/10/14 06:58
2014-12  14641.870           157  13/11/14 06:58
2015-01  18223.299           205  13/12/14 06:58
2015-02  15522.299           137  13/01/15 06:58
2015-03  22750.441           101  12/02/15 20:15

In [82]:
grouped = phone.groupby(['month', 'item'])

In [83]:
grouped.agg({'duration':sum, 'network_type': 'count', 'date': 'first'})

               duration  network_type            date
month   item
2014-11 call  25547.000           107  15/10/14 06:58
        data    998.441            29  15/10/14 06:58
        sms      94.000            94  16/10/14 22:18
2014-12 call  13561.000            79  14/11/14 17:24
        data   1032.870            30  13/11/14 06:58
        sms      48.000            48  14/11/14 17:28
2015-01 call  17070.000            88  15/12/14 20:03
        data   1067.299            31  13/12/14 06:58
        sms      86.000            86  15/12/14 19:56
2015-02 call  14416.000            67  15/01/15 10:36
        data   1067.299            31  13/01/15 06:58
        sms      39.000            39  15/01/15 12:23
2015-03 call  21727.000            47  12/02/15 20:15
        data    998.441            29  13/02/15 06:58
        sms      25.000            25  19/02/15 18:46

In [86]:
grouped.agg({'duration':[min, max, sum], 'network_type': 'count', \
             'date': [min, 'first', 'unique']}).head()

             duration                      network_type            date  \
                  min       max        sum        count             min
month   item
2014-11 call    1.000  1940.000  25547.000          107  01/11/14 15:13
        data   34.429    34.429    998.441           29  01/11/14 06:58
        sms     1.000     1.000     94.000           94  03/11/14 08:40
2014-12 call    2.000  2120.000  13561.000           79  02/12/14 11:40
        data   34.429    34.429   1032.870           30  01/12/14 06:58

                              \
                       first
month   item
2014-11 call  15/10/14 06:58
        data  15/10/14 06:58
        sms   16/10/14 22:18
2014-12 call  14/11/14 17:24
        data  13/11/14 06:58


                                                         unique
month   item
2014-11 call  [15/10/14 06:58, 15/10/14 14:46, 15/10/14 14:4...
        data  [15/10/14 06:58, 16/10/14 06:58, 17/10/14 06:5...
        sms   [16/10/14 22:18, 16/10/14 22:21, 17/10/14 10:5...
2014-12 call  [14/11/14 17:24, 16/11/14 14:05, 19/11/14 14:0...
        data  [13/11/14 06:58, 14/11/14 06:58, 15/11/14 06:5...

In [88]:
wages = pd.read_csv('wages.csv')

In [89]:
wages.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [90]:
race_dict = dict(enumerate(wages.race.unique()))
race_dict

{0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}

In [91]:
new_dict = {}
for i in race_dict.items():
    new_dict[i[1]] = i[0]
new_dict

{'white': 0, 'other': 1, 'hispanic': 2, 'black': 3}

In [92]:
new_dict

{'white': 0, 'other': 1, 'hispanic': 2, 'black': 3}

In [94]:
wages['race'].map(new_dict)

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

In [96]:
wages['race'].map(len)

0       5
1       5
2       5
3       5
4       5
       ..
1374    5
1375    5
1376    5
1377    5
1378    5
Name: race, Length: 1379, dtype: int64

In [97]:
wages['race'].apply(len)

0       5
1       5
2       5
3       5
4       5
       ..
1374    5
1375    5
1376    5
1377    5
1378    5
Name: race, Length: 1379, dtype: int64

In [174]:
race_dict

{0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}

In [175]:
key = race_dict.keys()
values = race_dict.values()

In [176]:
key

dict_keys([0, 1, 2, 3])

In [179]:
wages['race'].replace(to_replace = values, value =key)

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64